#include <reg52.h>
#include "motor.h"
#include "delay.h"
#define LED P1

void xunji (void);
void bluetooth (void);
void chuankou_init (void);


unsigned char a;  //保存接受的值

/*引脚定义区域*/

/**************************************************************/
sbit hw1  = P0^4;                /*循迹红外传感器1*/
sbit hw2  = P0^5;               /*循迹红外传感器2*/
sbit hw3  = P0^6;               /*避障红外传感器3*/
sbit key1 = P3^3;              /*定义按键 key1--蓝牙模式*/
sbit key2 = P3^4;             /*定义按键 kay2--循迹模式*/
sbit FMQ = P0^7;             /*定义蜂鸣器*/
/**************************************************************/


/*主函数模块*/

/**************************************************************/
/**************************************************************/
void main (void)

{
	if (key1 == 0)
	{
		bluetooth ();
	}

	if (key2 == 0)
	{
		xunji ();
	}
}
/**************************************************************/
/**************************************************************/




/*循迹模式 & 避障模式*/
/**************************************************************/
void xunji (void)
{
	while (1)	
	{
		if (hw3 == 1)
		{
			if ( hw1 == 0 && hw2 ==1)
			{
				left ();
				LED = 0X00;
				continue;
			}

			if (hw2 == 0 && hw1 ==1)
			{	
				right();
				LED = 0X00;
				continue;
			}
			
			if (hw1 == 1 && hw2 == 1)
			{
				down ();
				LED = 0X00;
				continue;
			}

			if (hw1 == 0 && hw2 ==0)
			{
				up ();
				LED = 0X00;
				continue;
			}
		}
		
		if (hw3 == 0) 
		{
			up();
			delay(500);
			right();
			delay(550);
			continue;
		}
		
	}
}
/**************************************************************/




/*蓝牙模块*/
/*************************************************************/
void bluetooth (void)
{
	chuankou_init();
	while (1)
	{
		switch (a)
		{
			case 0:
			{
				stop();
				LED = 0xff;
				break;
			}
			case 1:
			{
				up();
				LED = 0x00;
				break;
			}
			case 2:
			{
				down();
				LED = 0x00;
				break;
			}
			case 3:
			{
				left();
				LED = 0x00;
				break;
			}
			case 4:
			{
				right();
				LED = 0x00;
				break;
			}

		}
	}
}
/**************************************************************/





/*初始化串口模块*/

/*************************************************************/
void chuankou_init (void)
{
	TMOD = 0x20;  //定时器的模式
	TH1 = 0xfd;  //波特率设置为9600
	TL1 = 0xfd;                                                                          
	TR1 = 1;   //相当于打开定时器1
	SM0 = 0;   //设置串口工作模式
	SM1 = 1;
	REN = 1;  //允许接受
	EA = 1;
	ES = 1;  //打开串口中断
}
/************************************************************/


/*中断模块*/

/************************************************************/
void chuankou (void) interrupt 4
{	
	RI = 0; //接收置为0，后续可以接收
	a = SBUF;
}
/************************************************************/
